# Challenge 3

In this challenge we will work on the `Orders.csv` data set in the previous [Subsetting and Descriptive Stats lab](../../lab-subsetting-and-descriptive-stats/your-code/main.ipynb). In your work you will apply the thinking process and workflow we showed you in Challenge 2.

You are serving as a Business Intelligence Analyst at the headquarter of an international fashion goods chain store. Your boss today asked you to do two things for her:

**First, identify two groups of customers from the data set.** The first group is **VIP Customers** whose **aggregated expenses** at your global chain stores are **above the 95th percentile** (aka. 0.95 quantile). The second group is **Preferred Customers** whose **aggregated expenses** are **between the 75th and 95th percentile**.

**Second, identify which country has the most of your VIP customers, and which country has the most of your VIP+Preferred Customers combined.**

# Q1: How to identify VIP & Preferred Customers?

We start by importing all the required libraries:

In [1]:
# import required libraries
import numpy as np
import pandas as pd

Next, import `Orders.csv` from the "subsetting" lab folder into a dataframe variable called `orders`. Print the head of `orders` to overview the data:

In [12]:
# enter your code here
orders = pd.read_csv("Orders.csv")
orders.head(10)

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
5,5,536365,22752,2010,12,3,8,set 7 babushka nesting boxes,2,2010-12-01 08:26:00,7.65,17850,United Kingdom,15.30
6,6,536365,21730,2010,12,3,8,glass star frosted t-light holder,6,2010-12-01 08:26:00,4.25,17850,United Kingdom,25.50
7,7,536366,22633,2010,12,3,8,hand warmer union jack,6,2010-12-01 08:28:00,1.85,17850,United Kingdom,11.10
8,8,536366,22632,2010,12,3,8,hand warmer red polka dot,6,2010-12-01 08:28:00,1.85,17850,United Kingdom,11.10
9,9,536367,84879,2010,12,3,8,assorted colour bird ornament,32,2010-12-01 08:34:00,1.69,13047,United Kingdom,54.08

---

"Identify VIP and Preferred Customers" is the non-technical goal of your boss. You need to translate that goal into technical languages that data analysts use:

## How to label customers whose aggregated `amount_spent` is in a given quantile range?

We break down the main problem into several sub problems:

#### Sub Problem 1: How to aggregate the  `amount_spent` for unique customers?

#### Sub Problem 2: How to select customers whose aggregated `amount_spent` is in a given quantile range?

#### Sub Problem 3: How to label selected customers as "VIP" or "Preferred"?

*Note: If you want to break down the main problem in a different way, please feel free to revise the sub problems above.*

Now in the workspace below, tackle each of the sub problems using the iterative problem solving workflow. Insert cells as necessary to write your codes and explain your steps.

In [31]:
# your code here
invoice_group = orders.groupby(['InvoiceNo','CustomerID','Country']).agg({'amount_spent' : 'sum'})
customer_gruop = invoice_group.groupby(['CustomerID','Country']).agg({'amount_spent' : 'mean'})
preferred_cutoff = customer_gruop.amount_spent.quantile(0.75)
vip_cutoff = customer_gruop.amount_spent.quantile(0.95)
customer_gruop

                           amount_spent
CustomerID Country
12346      United Kingdom  77183.600000
12347      Iceland           615.714286
12348      Finland           449.310000
12349      Italy            1757.550000
12350      Norway            334.400000
...                                 ...
18280      United Kingdom    180.600000
18281      United Kingdom     80.820000
18282      United Kingdom     89.025000
18283      United Kingdom    130.930000
18287      United Kingdom    612.426667

[4347 rows x 1 columns]

In [36]:
print('VIP Clients')
vip = customer_gruop[customer_gruop.amount_spent >= vip_cutoff]
vip

VIP Clients

                           amount_spent
CustomerID Country
12346      United Kingdom  77183.600000
12349      Italy            1757.550000
12354      Spain            1079.400000
12357      Switzerland      6207.670000
12359      Cyprus           1593.145000
...                                 ...
18102      United Kingdom   4327.621667
18139      United Kingdom   1406.390000
18192      United Kingdom    957.970000
18194      United Kingdom    973.840000
18251      United Kingdom   4314.720000

[218 rows x 1 columns]

In [43]:
print('Preferred Clients')
preferred = customer_gruop[ (customer_gruop.amount_spent >= preferred_cutoff) & (customer_gruop.amount_spent <= vip_cutoff) ]
preferred

Preferred Clients

                           amount_spent
CustomerID Country
12347      Iceland           615.714286
12348      Finland           449.310000
12355      Bahrain           459.400000
12356      Portugal          937.143333
12358      Austria           584.030000
...                                 ...
18242      United Kingdom    558.122500
18259      United Kingdom    779.533333
18260      United Kingdom    440.533333
18272      United Kingdom    513.096667
18287      United Kingdom    612.426667

[869 rows x 1 columns]

Now we'll leave it to you to solve Q2 & Q3, which you can leverage from your solution for Q1:

# Q2: How to identify which country has the most VIP Customers?

# Q3: How to identify which country has the most VIP+Preferred Customers combined?

Provide your solution for Q2 below:

In [41]:
# Q2
vip.reset_index().Country.mode()

0    United Kingdom
dtype: object

In [45]:
# Q3
pd.concat([vip, preferred]).reset_index().Country.mode()

0    United Kingdom
dtype: object